thibautldz/BLE_Scanner/STM32_WPAN/App/app_ble.c
            APP_DBG_MSG("To which one you want to connect ? \n\r");

            HW_UART_Receive_IT(hw_uart1, buff_which , sizeof(buff_which), rx_usartCallBack);


          }
        }
        break;
#if (OOB_DEMO != 0)
        case EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ:
        {
          /* USER CODE BEGIN EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ */

          /* USER CODE END EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ */
          aci_l2cap_connection_update_req_event_rp0 *pr = (aci_l2cap_connection_update_req_event_rp0 *) blue_evt->data;
          aci_hal_set_radio_activity_mask(0x0000);
          APP_BLE_p2p_Conn_Update_req.Identifier = pr->Identifier;
          APP_BLE_p2p_Conn_Update_req.L2CAP_Length = pr->L2CAP_Length;
          APP_BLE_p2p_Conn_Update_req.Interval_Min = pr->Interval_Min;
          APP_BLE_p2p_Conn_Update_req.Interval_Max = pr->Interval_Max;
          APP_BLE_p2p_Conn_Update_req.Slave_Latency = pr->Slave_Latency;
          APP_BLE_p2p_Conn_Update_req.Timeout_Multiplier = pr->Timeout_Multiplier;

          result = aci_l2cap_connection_parameter_update_resp(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                                           APP_BLE_p2p_Conn_Update_req.Interval_Min,
                                                           APP_BLE_p2p_Conn_Update_req.Interval_Max,
                                                           APP_BLE_p2p_Conn_Update_req.Slave_Latency,
                                                           APP_BLE_p2p_Conn_Update_req.Timeout_Multiplier,
                                                           CONN_L1,
                                                           CONN_L2,
                                                           APP_BLE_p2p_Conn_Update_req.Identifier,
                                                           0x01);
          if(result != BLE_STATUS_SUCCESS) {
              /* USER CODE BEGIN BLE_STATUS_SUCCESS */
              BSP_LED_On(LED_RED);
              /* USER CODE END BLE_STATUS_SUCCESS */
          }
          aci_hal_set_radio_activity_mask(0x0020);

        }

        break;

        case 0x0004:
        {
          /* USER CODE BEGIN RADIO_ACTIVITY_EVENT */
          BSP_LED_On(LED_GREEN);
          HW_TS_Start(BleApplicationContext.SwitchOffGPIO_timer_Id, (uint32_t)LED_ON_TIMEOUT);
          /* USER CODE END RADIO_ACTIVITY_EVENT */
        }
        break;
#endif

        /* USER CODE BEGIN BLUE_EVT */

        /* USER CODE END BLUE_EVT */

        default:
          /* USER CODE BEGIN ecode_default */

          /* USER CODE END ecode_default */
          break;

      }
    }
    break;

    case EVT_DISCONN_COMPLETE:
      {
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

      /* USER CODE END EVT_DISCONN_COMPLETE */
      if (cc->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
          {
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
            BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
            APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH SERVER \n");
            handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
            handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            P2PC_APP_Notification(&handleNotification);
          }
       }
      break; /* EVT_DISCONN_COMPLETE */

    case EVT_LE_META_EVENT:
    {
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      meta_evt = (evt_le_meta_event*) event_pckt->data;

      switch (meta_evt->subevent)
      {
      /* USER CODE BEGIN subevent */

      /* USER CODE END subevent */
          case EVT_LE_CONN_COMPLETE:
          /* USER CODE BEGIN EVT_LE_CONN_COMPLETE */

          /* USER CODE END EVT_LE_CONN_COMPLETE */
          /**
           * The connection is done,
           */
          connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
          BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;

          /* CONNECTION WITH CLIENT */
          APP_DBG_MSG("\r\n\r** CONNECTION EVENT WITH SERVER \n");
          handleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
          handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
          P2PC_APP_Notification(&handleNotification);

          result = aci_gatt_disc_all_primary_services(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
          if (result == BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n");
            APP_DBG_MSG("* GATT :  Start Searching Primary Services \r\n\r");
          }
          else
          {
            APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
          }

          break; /* HCI_EVT_LE_CONN_COMPLETE */

        case EVT_LE_ADVERTISING_REPORT:
        {
          uint8_t *adv_report_data;
          /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT */

          /* USER CODE END EVT_LE_ADVERTISING_REPORT */
          le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;

          event_type = le_advertising_event->Advertising_Report[0].Event_Type;

          event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;

          adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;

			uint8_t ind;
			// If BLE device not yet found, store it in array scan_report[]
			if (!contains_address(
					le_advertising_event->Advertising_Report[0].Address,
					&ind)) {
				index_tab++;

				// Store BLE address which uniquely identifies BLE device
				for (int k = 0; k < BD_ADDR_SIZE; k++) {
					scan_report[ind].ScanAddr[k] =
							le_advertising_event->Advertising_Report[0].Address[k];
				}
			}
/* WARNING:
The data and RSSI values could not be directly decoded from the RAM using the data and RSSI field from hci_le_advertising_report_event_rp0 structure.
Instead they must be read by using offsets.
RSSI = *(uint8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
*/
			// Store RSSI
			scan_report[ind].ScanRSSI = *(int8_t*) (adv_report_data
					+ le_advertising_event->Advertising_Report[0].Length_Data);

			// Search for COMPLETE_LOCAL_NAME and store it
			int p = 0;
			while (p < event_data_size) {
				adlength = adv_report_data[p];
				adtype = adv_report_data[p + 1];

				switch (adtype) {
				case COMPLETE_LOCAL_NAME:
					for (int t = 0; t < adlength - 1; t++) {
						scan_report[ind].ComleteLocalName[t] =
								(adv_report_data[p + 2 + t]);
					}
					break;
				case AD_TYPE_FLAGS: /* now get flags */
					/* USER CODE BEGIN AD_TYPE_FLAGS */

					/* USER CODE END AD_TYPE_FLAGS */
					break;
				case AD_TYPE_TX_POWER_LEVEL: /* Tx power level */
					/* USER CODE BEGIN AD_TYPE_TX_POWER_LEVEL */

					/* USER CODE END AD_TYPE_TX_POWER_LEVEL */
					break;
				case AD_TYPE_MANUFACTURER_SPECIFIC_DATA: /* Manufacturer Specific */
					/* USER CODE BEGIN AD_TYPE_MANUFACTURER_SPECIFIC_DATA */
				case AD_TYPE_SERVICE_DATA: /* service data 16 bits */
					/* USER CODE BEGIN AD_TYPE_SERVICE_DATA */

					/* USER CODE END AD_TYPE_SERVICE_DATA */
					break;
				default:
					/* USER CODE BEGIN adtype_default */

